/**
 * Created by јлексей on 16.06.2015.
 */
/**«адание 3 (FizzBuzz)

 Ќапишите программу, котора€ выводит через console.log все числа от 1 до 100, с двум€ исключени€ми. ƒл€ чисел,
 нацело дел€щихс€ на 3, она должна выводить СFizzТ, а дл€ чисел, дел€щихс€ на 5 (но не на 3) Ц СBuzzТ.*/
for (i=1; i<100; i++)
{

    console.log(i);
    if ((i%3) == 0){
        console.log('Fizz');
    }
    else if ((i%5) == 0 ){
        console.log('Buzz');
    }
    else {
        console.log(i);
    }


}

/**|| (i%3) != 0*/